{
    "birds": [
        {
            "name": "cockatoo",
            "price": "872.66",
            "des": " cockatoo is any of the 21 parrot species belonging to the family Cacatuidae, the only family in the superfamily Cacatuoidea. Along with the Psittacoidea (true parrots) and the Strigopoidea (large New Zealand parrots), they make up the order Psittaciformes. The family has a mainly Australasian distribution, ranging from the Philippines and the eastern Indonesian islands of Wallacea to New Guinea, the Solomon Islands and Australia.\n\nCockatoos are recognisable by the prominent crests and curved bills. Their plumage is generally less colourful than that of other parrots, being mainly white, grey or black and often with coloured features in the crest, cheeks or tail. On average they are larger than other parrots; however, the cockatiel, the smallest cockatoo species, is a small bird. The phylogenetic position of the cockatiel remains unresolved, other than that it is one of the earliest offshoots of the cockatoo lineage. The remaining species are in two main clades. The five large black coloured cockatoos of the genus Calyptorhynchus form one branch. The second and larger branch is formed by the genus Cacatua, comprising 11 species of white-plumaged cockatoos and four monotypic genera that branched off earlier; namely the pink and white Major Mitchell's cockatoo, the pink and grey galah, the mainly grey gang-gang cockatoo and the large black-plumaged palm cockatoo. ",
            "des-short": "cockatoos are noisy, but form strong bonds with their owners",
            "ref": "https://en.wikipedia.org/wiki/Cockatoo",
            "img-ref": "https://lafeber.com/vet/basic-information-sheet-for-the-cockatoo/",
            "url": "assets/images/pet-shop-animal-bird/",
            "img-name": "pet-shop-cockatoo-moluccan.jpg",
            "index": 0
        },
        {
            "name": "parakeet",
            "price": "498.87",
            "des": "parakeets are a smaller member of the parrot family, and with proper care can live up to 20 years. The parakeet has become a popular pet due to its often striking colors and ease of taming.\n\nParakeets are very social birds and prefer to be kept in pairs or small groups. The genders in a group or pair can be mixed. If you do not want to breed your birds, it is suggested to keep them in groups of the same gender.\n\nWings and nails can be trimmed to ease the taming process. Many veterinary clinics offer this service. Clipping wings and nails should only be attempted after proper instruction provided by your vet. Parakeets, being a smaller bird, have only a small amount of blood in their bodies and can easily bleed to death if a feather or nail is trimmed too close to a vein.\n\nParakeets have a very active metabolism and can easily become ill if they go without food for 24 hours. Parakeets should be provided with a staple diet of fresh parakeet seed or pellets daily. Be sure to check the food dish daily, as they will only eat from the top of what is offered. In addition to a pellet diet, parakeets should be offered chopped dark green and yellow veggies as well as a variety of fruits, hard cooked eggs, and grated cheese. Remember to remove fresh foods after two hours to prevent them from spoiling. If the bird's stool becomes runny, it could be due to receiving too much liquid from the fresh fruits and vegetables. If this becomes an issue, restrict the fresh foods for a day to see if the issue resolves. Millet Spray is also an excellent supplement for Parakeets.\n\nParakeets need fresh water every day. Be sure to wash and rinse the dish thoroughly each day to prevent bacterial growth. Supplemental powdered vitamins can also be sprinkled on the food. Refrain from adding them to the water as it can support growth of bacteria. Cuttlebones should also be provided to supply your parakeet with calcium and prevent overgrowth of the beak.\n\n--\\",
            "des-short": "parakeets are a great beginner parot, but take some work to bond to owner",
            "ref": "https://www.animalhumanesociety.org/adoption/parakeet-budgerigar-care",
            "img-ref": "https://www.animalhumanesociety.org/adoption/parakeet-budgerigar-care",
            "img-name": "pet-shop-parakeet.jpg",
            "url": "assets/images/pet-shop-animal-bird/",
            "index": 1
        },
        {
            "name": "finch",
            "price": "441.56",
            "des": "the zebra finch (Taeniopygia guttata)[2] is the most common estrildid finch of Central Australia and ranges over most of the continent, avoiding only the cool moist south and some areas of the tropical far north. It can also be found natively on Timor island. The bird has been introduced to Puerto Rico and Portugal.[1]\nThe zebra finch has the most extensive mainland distribution of the Australian estrilids, being found in about 75% of mainland Australia, as the subspecies Taeniopygia guttata castanotis. This subspecies is generally not found on the coasts, except for the arid western edge.[11] As the subspecies T. g. guttata, it is distributed from the islands Lombok and Sumbawa in the Lesser Sundas east to Luang and Sermata, and south to Sumba, Sawu, Dao, Roti, Semau, and Timor.[10]\nThe zebra finch (or at the very least, the subspecies T. g. castanotis) is generally found in more arid areas.[8] The areas it chooses to occupy are close to water, and places where rain is concentrated after it falls.[12] However, this is likely more related to the abundance of vegetation than the abundance of water as a resource in itself.[13] Within these areas, it is found in grasslands with scattered trees and shrubs, and in open or grassy woodlands.[8] It is also found in cultivated areas,[14] such as rice fields[10] It usually stays confined to the low coastal areas of the islands it inhabits, but it can move to elevations up to 2,300 metres (7,500 ft) to exploit expanding cultivation and grasslands.[15]\nAlthough zebra finch breeding, for example, is initiated by rainfall,[16] Klaus Immelmann proposed that sustained heavy precipitation is detrimental to the zebra finch. This is supported by the observation that the nest does not shield the chicks or eggs from rain, and rainfall can sometimes result in clutches being abandoned. Furthermore, it is supported by Immelmann's finding that zebra finches left Wyndham after the first heavy rains in November 1959, but returned to breed in April. It is hypothesised that birds in parts of northern Australia migrate inland during the wet season from October to May, and return to the coastal regions during the dryer months.[17]",
            "des-short": "finches are great observational birds, but they do not like a lot of handling",
            "ref": "https://en.wikipedia.org/wiki/Zebra_finch",
            "img-ref": "https://en.wikipedia.org/wiki/Zebra_finch",
            "img-name": "pet-shop-finch.jpg",
            "url": "assets/images/pet-shop-animal-bird/",
            "index": 2
        },
        {
            "name": "pigeon",
            "price": "298.21",
            "des": "If you have just one or two pigeons, you may opt to keep them in a large cage in your house. Keep the cage out of direct sunlight and away from drafts -- as well as any cats or dogs who share your household. Your bird's cage should measure at least 2 feet high by 2 feet wide and 2 feet long, but a larger cage is preferable. Clean the cage daily.\n\nAn outdoor pigeon coop or loft is also suitable housing, and that's where you would keep homing or racing pigeons. If you purchase or build your own coop, make sure the pigeon's flying area faces south, and keep it away from trees or other buildings. The coop must stay dry -- pigeons don't like wet environments. Lining the floor with straw or shavings, and cleaning it regularly usually keeps it dry and free from molds. Provide plenty of strong perches and avoid overcrowding your birds. Place a shallow bowl of water in the coop a few times a week for pigeons to bathe. Leave it there for a few hours and then remove the dirty water.\n\nIf you keep your birds outdoors, build the coop high enough or include sufficient space in the aviary section for adequate exercise. If your pigeons stay inside, you can let them fly outside of the cage regularly -- two hours daily is ideal -- but take precautions beforehand.\n\nFor best results, give your birds commercial feeds designed specifically for pigeons. Avoid seed-only diets and opt for pelleted feeds, if available. Feeding a seed-only diet can cause calcium deficiency. In addition, offer your birds a selection of cleaned and chopped fresh vegetables and fruits daily. Suitable choices include:\n\n    fruit, including apples, pears and cantaloupe\n    greens, including kale and spinach\n    broccoli and carrots\n    and blueberries.\n\nPigeons also enjoy bits of breadcrumbs, mashed eggs and cooked rice. For a special treat, serve your birds meal worms. Your pigeons should always have fresh, clean water available. Clean your birds' food and water containers every day.\n\nIf you have racing or homing pigeons, add supplements to their food. Provide them with grit and/or oyster shells. The latter supplies extra calcium, and isn't included in standard commercial pigeon feeds.\n\nIf you have fancy or fantail pigeons, add oyster shells or other calcium supplements to their diet, especially if they are pets kept indoors. Such supplements are advisable for any indoor dove or pigeon.",
            "des-short": "pigeons are good pet birds for apartments and small housing",
            "ref": "https://www.cuteness.com/article/care-pigeon",
            "img-ref": "https://www.britannica.com/quiz/pigeons-fact-or-fiction",
            "img-name": "pet-shop-pigeon.jpg",
            "url": "assets/images/pet-shop-animal-bird/",
            "index": 3
        },
        {
            "name": "chicken",
            "price": "698.92",
            "des": "After several years of pestering my wife to get backyard chickens, she finally relented this past fall. I made all the traditional arguments: the kids will love them, we’ll have fresh eggs every day, I promise to clean the yard and the coop, no it won’t smell, trust me — and on and on. I would overtly send her photos of cool chicken coops hoping that one day she’d like one and magically say ‘yes’ to my request. Alas, this went on for about five years and the arguments were always the same. We have no room in the yard. They will indeed smell. Who’s going to clean up after them? You are too busy. Yadda yadda yadda.\n\nBut I was unwilling to lose this war of attrition. My plan was to convince the kids that it would be a good thing for us and that they could pick out the chicks. Last October I was able to get the family down to Portage Bay Grange in Seattle’s University District and home of all things backyard chicken and more. After showing my family the freshly hatched chicks, I knew I had won. I mean, who can resist a fluffy little chick?\n\nI should have known better than to attempt to build a chicken coop without a plan. I had dreams of creating an affordable coop using scrap wood and old wine cases for siding that could be wheeled around the yard as needed. $500 and about 60 hours of labor later – I have built a battleship. Yes, it’s pretty, but completely overbuilt and inefficient. The wheels sit on my porch, unable to bear the weight of the massive amounts of lumber and nails that went into this bad boy.\n\nLesson learned. Saltbox Designs in the Ballard neighborhood of Seattle creates beautiful chicken coops (among other things) at an affordable price. Go there and save yourself the time and frustration of realizing you are likely not adept at carpentry or building anything.\n",
            "des-short": "chickens are hardy birds that are easy to keep outside because they can't fly away",
            "ref": "https://modernfarmer.com/2014/07/raising-backyard-chickens-dummies/",
            "img-ref": "https://www.treehugger.com/are-chickens-new-popular-pet-4855984",
            "img-name": "pet-shop-chicken.jpg",
            "url": "assets/images/pet-shop-animal-bird/",
            "index": 4
        }
    ],
    "reptiles": [
        {
            "name": "leopard gecko",
            "price": "615.38",
            "des": "Leopard geckos can live their entire lives happily in a 10-20 gallon aquarium. Too large of a tank can actually inhibit the gecko from being at the appropriate temperature. Newspaper, pea gravel, or flat stones work best as bedding. Reptile carpet is also an excellent substrate that can be easily washed once dirty. Sand or particulate bedding tend to cause impactions and can pose a serious health risk.\n\nLeopard geckos require a hotspot of 86-90° F, and the cooler side of their tank should be around 75-80° F. This can be done using a heat lamp on one side of the cage. A natural heat gradient will occur to allow your gecko to choose what temperature it wants to be at any time. Heat rocks are not recommended because they can get too hot and burn your gecko.\nLeopard geckos prefer hide spots in their tank. There are plenty of ornate hide spots that will spice up your gecko’s cage.\n\nFor leopard geckos, crickets are best for feeding. They should be dusted with a calcium/vitamin D3 powder every other day to help with bone growth. Leopard geckoes should also have their food dusted with a multivitamin once weekly. Zoo Med makes ideal products for ensuring your gecko has enough nutrients in his or her diet. A small amount should be readily available in a dish for the gecko at all times. A good feeding guideline is to feed 2 insects for every inch of the animal’s total body length every other day.\n\nFresh water should be available at all times for your gecko. He/she might also require soaking in lukewarm water every couple days when they are in shed.\n\nSigns of health Problems\nRetained sheds can cause deformities in leopard geckos, so when your gecko goes into shed, which is marked by a dulling of their color, that they have moisture available or are sprayed with water at least once daily until they have shed their skin. Retained sheds can sometimes be removed after soaking your gecko in some lukewarm water.\n\n You should contact Kingsbrook Animal Hospital in Frederick, MD if you think your gecko is having any eye problems or impactions, as these can become very serious health risks an should be addressed by a veterinarian.",
            "des-short": "leopard geckos are the best lizard to start off for people new to keeping reptiles",
            "ref": "https://kingsbrookvet.com/blog/leopard-gecko-husbandry/",
            "img-ref": "https://kingsbrookvet.com/blog/leopard-gecko-husbandry/",
            "img-name": "pet-shop-leopard-gecko.jpg",
            "url": "assets/images/pet-shop-animal-reptile/",
            "index": 0
        },
        {
            "name": "crested gecko",
            "price": "804.18",
            "des": "The crested gecko looks a lot like the friends we find climbing on walls and scampering down sidewalks here in Florida but with one difference. These little lizards have crested lines/spines that run from their eyes down their backs on either side, making them look a lot like teeny, tiny wingless dragons.\n\nIn fact, since the crest originates at their eyes it can give them the appearance of having eyelashes. That’s why some people refer to them as the eyelash gecko.\n\nWhile they don’t look like they’d be much trouble to take care of, there are a few things you need to know about the crested gecko before you decide to make them a pet.\n\nTheir specialized toe pads allow them to climb all kinds of surfaces. That’s why it’s extremely important to keep this in mind when selecting a home for them. You never want to leave an opening in the ceiling of their habitat. They will find it and escape.\n\nCrested geckos are semi-arboreal, which means they like to spend most of their time in trees so you want a habitat that accommodates that. They won’t want to be on the ground in a sandy aquarium. Crested geckos want lush foliage and places to climb.\n\nSince some adult geckos can grow to be four inches, not including their tail length, a small twig won’t do either. You want a 20-gallon aquarium (or larger) for this small creature. Many owners make the mistake seeing a relatively small lizard and assuming it doesn’t need a very big space.\n\nUnlike some lizards, crested geckos don’t need a heat lamp. Room temperature is just fine. However, what they do need is a humid environment. Not difficult if you live here in Florida. However, if you don’t, especially if you live somewhere very dry, you’ll want to mist the environment two or three times a day with a squirt bottle of warm, filtered water.\n\nSome people who adopt reptiles are into the cool factor of walking around with the animal on their hand, arm, or shoulder. While many lizards don’t tolerate handling very well, the crested gecko does. Although young geckos may be slightly jumpy when taken out of the cage, as they mature, they become more docile and easier to handle. All in all, they are relatively low maintenance pets.\n\nThe one thing that most crested gecko owners don’t realize is that when you take care of these animals they can live 15 to 20 years. An animal that lives 15-20 years will be with you for a lot of changes in your life. So before adopting a crested gecko consider if you or your family is willing to make that commitment. If not, you may want to look for an animal with a shorter life span.",
            "des-short": "crested geckos should only be handled on occasion, they live in the trees and get scared easily",
            "ref": "https://kissagator.com/blog/adopting-a-crested-gecko-what-you-need-to-know/",
            "img-ref": "https://kissagator.com/blog/adopting-a-crested-gecko-what-you-need-to-know/",
            "img-name": "pet-shop-crested-gecko.jpg",
            "url": "assets/images/pet-shop-animal-reptile/",
            "index": 1
        },
        {
            "name": "skink",
            "price": "101.67",
            "des": "While it is not common for the Blue Tongued Skink reptile to have feeding problems, you might occasionally come across certain dietary abnormalities with your reptile. Clearly, you need to know what you should do in such situations, what items in their diet plan to change or remove completely. If such strategies do not work, get in touch with an animal expert or reptile expert as soon as possible for further assistance and guidance.\n\nPeople who keep Blue Tongued Skink reptile for the first time run into the problem of the frequency with which to feed the reptile. This is because these creatures have a habit of eating any and all amounts of food that is put in front of them. Do not be fooled by this behavior because if you continue to feed them, they can overeat and become fat or even get sick.\n\nOther people might have a reptile that refuses to eat for months at an end, usually the winters. Normally, such reptiles will stop eating completely without any types of abnormalities and this could especially be the case in the breeding season. If you do not want your reptile to breed, you should continue to offer food once a week even if he does not respond to any meal. It is possible that you have been keeping the same diet for too long and the skink has grown tired of it.\n\nTry to boost his appetite by offering a fuzzy mouse or something unique. Sometimes, this will not work as the skink is being stubborn and does not want to eat. Some Blue Tongued Skink reptiles may only like certain thing which is why you will have to apply the trial and error method to find out what those things are. For instance, if your Blue Tongued Skink reptile only eats fruits then you can take away the fruit from their diet and offer them vegetables combined with cat food. Something like this should get his attention and encourage him to start eating again.\n\nSometimes, your Blue Tongued Skink reptile may get diarrhea as well in which case you should keep him away from soft foods like kiwi and give him solid foods like broiled chicken. With such a diet plan, his bowel movements and digestive system will get back on track soon enough. If you have offered live prey to the reptile like insects or rodents and they are left uneaten, don’t forget to remove the prey from the reptile’s enclosure on a timely basis.",
            "des-short": "skinks can be somewhat agressive. keep away from children",
            "ref": "https://www.bluetongueskink.org/feeding-precautions/",
            "img-ref": "https://www.bluetongueskink.org/feeding-precautions/",
            "img-name": "pet-shop-skink.jpg",
            "url": "assets/images/pet-shop-animal-reptile/",
            "index": 2
        },
        {
            "name": "bearded dragon",
            "price": "390.63",
            "des": "Relatively hardy, the bearded dragon (Pogona) can resist changes in temperature and variations in its routine much better than many other types of domestic lizards. However, this doesn’t mean that a pet bearded dragon will be cautious, shy or dull. In fact, they are very energetic creatures that are a delight to watch and play with. They also often bond with their owners and can be quite tame when they are being handled.\n\nAcquiring a Bearded Dragon\n\nBearded dragons are bred widely in captivity, which means they are available at many larger pet stores. You can also buy your bearded dragon from a breeder, but it is recommended that you check the breeder’s credentials before going through with a transaction. Some breeders also have bearded dragons available in unusual or unique colors or patters, but these often cost more than regular dragons.\n\nCaging a Bearded Dragon\n\nYoung bearded dragons can temporarily live in 25-gallon aquarium, but adults should be caged in at least a 75-gallon aquarium. Two bearded dragons can generally live together, especially if they are a breeding pair. Avoid using sand in the bottom of the cage since the bearded dragon can become sick if it accidentally eats some. Use newspaper, towers or reptile carpeting as litter instead. Make sure that the top of the tank is adequately ventilated with a screen, and contains several large branches or toys to climb on.\n\nLighting and Temperature for a Bearded Dragon\n\nDuring warm weather, bearded dragons can be kept outside. Make sure they have an area that gets direct sunlight as well as a shaded area where they can retreat from the heat. When caging your dragon inside, make sure to keep their enclosure warm. This can be accomplished either by installing a spotlight over the dragon’s basking area or by placing heat emitters at strategic locations around the cage.\n\nFeeding and Watering a Bearded Dragon\n\nBearded dragons are omnivorous and not picky about their food. It is recommended that you feed them a mixture of fresh fruits or vegetables as well as mealworms, crickets or other insect protein. Any food you give your bearded dragon should be dusted with a calcium supplement powder, available from your pet store. You can use a spray bottle to give water to your bearded dragon. Simply lightly mist the inside of the cage or some of the structures inside.\n\nHandling a Bearded Dragon\n\nBearded dragons are generally quite docile and receptive to being held. Some like to perch on their owner’s shoulder and climb on them. While there may be the occasional exception, most bearded dragons that are bred in captivity do not bite and are quite curious about people.\n\nBearded dragons can be very rewarding pets, but like most exotic animals they require specialized care. Be sure to follow these tips and any special instructions from your pet store to ensure that your pet bearded dragon lives a long and healthy life.",
            "des-short": "bearded dragons are very calm reptiles, however they are not the brightest",
            "ref": "https://www.bigalspets.com/blog/terrariums/keeping-a-pet-bearded-dragon-what-you-should-know/",
            "img-ref": "https://www.bigalspets.com/blog/terrariums/keeping-a-pet-bearded-dragon-what-you-should-know/",
            "img-name": "pet-shop-bearded-dragon.jpg",
            "url": "assets/images/pet-shop-animal-reptile/",
            "index": 3
        },
        {
            "name": "green anole",
            "price": "483.95",
            "des": "Green anoles are known by many names but they are also known for their ability to change colors from green to brown and back again (although they are not true chameleons). They are often found running around and basking in the sun in the Southeastern United States and islands in the Caribbean as well as in terrariums across the country as pets.\n\n    Name: Anolis carolinensis, green anole, Carolina anole, American anole, American chameleon, red-throated anole\n    Size: Males reach 8 inches long (including the tail) in captivity but are larger in the wild; females are smaller\n    Lifespan: Around 4 years, although they can live up to 8 or more years, if well cared for\n\nGreen Anole Behavior and Temperament\n\nGreen anoles are the only breed of anole native to the United States; they can be found in the wild in Tennessee, Louisiana, Georgia, Florida, the Carolinas, and Texas. Green anoles are very popular and make good \"starter\" pets for children. These pretty little lizards have emerald-green backs and pink \"dewlaps\" (pouches under their chins). An occasional anole may even have a blue tint.\n\nAnoles are fun to watch, as they are active during the daytime and love to climb. One of their best attributes is their willingness to interact with their human owners; many are willing to eat from their owners' hands. While it is fine to pick an anole up (and many enjoy perching on a human shoulder), it's important to avoid grabbing them by the tail. Instead, teach children to pick them up by placing a hand under the lizard's belly.\nHousing the Green Anole\n\nAnoles can be housed in a fairly small tank or terrarium. A 10-gallon tank is sufficient for a single or pair of anoles. A larger tank is, of course, better though and if you are housing multiple anoles lots of space is necessary.\n\nYou should only keep one male anole per tank. Females will get along fine as long as the tank is roomy enough, and there plenty of basking spots and multiple places to hide. A securely fitted lid is necessary since green anoles can squeeze through very small places.\n\nA humidity level of 60 to 70 percent is necessary for green anoles (use a hygrometer to monitor these levels). This can usually be achieved by misting the inside of the tank daily. Misting systems are available although they are quite expensive. If you are having a hard time maintaining the humidity level try covering part of the top of the tank and/or increasing the number of live plants in the enclosure. Misting also provides drinking water for the anoles as they often will not drink from a bowl (they will lick droplets of water off the misted plants like chameleons).\nHeat and Lighting\n\nDuring the day be sure to provide a thermal gradient from 75 to 80 F (24 to 27 C) with a basking spot of 85 to 90 F (29 to 32 C). A combination of under tank heaters and a basking light on one side of the tank works well. Make sure the appropriate temperature gradient is provided by measuring temperatures in various spots around the tank. Night temperature can drop to a gradient of 65 to 75 F (18 to 24 C). Do not use white basking lights to achieve nighttime temperatures but instead use heating pads, ceramic heating elements, or special night heat lights.\n\nIn addition to the incandescent basking light, you should provide a full spectrum UVA/UVB light for 10 to 12 hours per day. This special light will help prevent your anole from developing metabolic bone disease and keep them looking brightly colored, active, and happy. The bulb needs to be changed out every six months (even if it hasn't burned out) and nothing should be blocking the light other than a metal mesh screen (no plastic or glass).\nSubstrate\n\nA substrate of peat moss and soil with or without a layer of bark (e.g. orchid bark) is an ideal substrate for anoles. Live plants help maintain humidity and provide cover. Favorite live plants include sansevierias (snake plants), bromeliads, philodendrons, ivy, orchids, and vines. Pieces of bark and branches should also be provided for climbing and basking. Avoid oily or scented substrates such as wood shavings, and stay away from very dry substrates such as sand.\nFood and Water\n\nGreen anoles are insectivores and are generally good eaters. While crickets can be the main part of the diet, it is best to feed a variety of gut loaded insects including mealworms and wax worms. Feed two to three appropriately-sized prey items that are about half the size of the anole's head every other day. A calcium and vitamin supplement should also be dusted on the insects.\nCommon Health Problems\n\nIn general, green anoles are hardy animals and are rarely ill. They can, however, develop respiratory issues, mouth rot, or a metabolic bone disease that results in weight loss and swollen joints. Look for:\n\n    Swollen joints\n    Loss of appetite\n    Smelly or runny stool\n    Weight loss\n    Difficulty breathing\n    Discharge from nose, eyes or mouth\n    Shedding problems or discolored skin\n\nYou should always consult a veterinarian if you see any of these problems. Meanwhile, however, do check to be sure that your pet's substrate and diet are appropriate, as problems with these are often the cause of stress-related illness.\nChoosing Your Green Anole\n\nGreen anoles are available at almost any pet shop and should be inexpensive (under $20). Look for an active, alert specimen and be sure that other anoles at the shop look healthy and well cared for. It's helpful to know that missing toes are not a problem: green anoles lose and regenerate them with no health implications.\n\nGive your new pet a few days to acclimate to its new home before taking it out to play. If possible, locate a vet with reptile experience, and bring in your green anole for a \"well pet\" checkup. ",
            "des-short": "green anoles are strictly observational, they will get stressed out very easily if picked up",
            "ref": "https://www.thesprucepets.com/keeping-green-anoles-as-pets-1236899",
            "img-ref": "https://www.everythingreptiles.com/green-anole/",
            "img-name": "pet-shop-green-anole.jpg",
            "url": "assets/images/pet-shop-animal-reptile/",
            "index": 4
        }
    ],
    "mammals": [
        {
            "name": "hamster",
            "price": "762.25",
            "des": "\n\nFirst discovered in Syria, hamsters are native to many parts of the world. The term \"hamster\" is derived from the German word “hamstern,” which means \"to hoard.” The term fits hamsters perfectly, because they hoard food. Hamsters are popular pets, but do have some special requirements to keep them happy and healthy.\n\nThe most common type of hamster kept as a pet is the six-inch Syrian hamster, which is also known as the Teddy Bear Hamster or the Golden Hamster. Dwarf hamsters such as the Siberian, Roborozsky’s Djungarian, and Chinese hamster are smaller than the Syrian hamsters, measuring just 2-3 inches in length. Lifespan for a hamster is typically 2-3 years.\n\nHamsters are nocturnal by nature and sleep during the day. Hamsters have unfortunately gained a reputation for biting, but this mostly happens when they are awakened during the day. It’s a natural defense to being startled awake. Due to their nocturnal nature and tendency to nip, they are not suitable pets for young children, and all children should be supervised by an adult when handling. As hamsters are “night owls,” be prepared for nightly routines of digging, scratching, and wheel-running. \n\nCommon signs that something may be wrong with your hamster include dull-looking eyes, matted fur, weight loss, shaking, diarrhea or runny nose. Hamsters also seem susceptible to respiratory problems, and can even catch a cold or pneumonia from humans. Avoid handling your hamster when you’re sick. If you notice any symptoms of illness, contact your veterinarian promptly.\n\n\n\nMost hamsters do well on a combination of rodent chow (rat blocks) and hamster pellet/seed mix. Look for a seed mix made up of pellets, grains, seeds, and dried vegetables. \n\nA small, bite size amount of fresh vegetables and fruit is recommended 2-3 times a week. Appropriate vegetables and fruits include carrots, spinach, lettuce, and apples. Introduce new foods gradually and remember to clean up any uneaten food before it spoils. Do not give your hamster onions, uncooked beans, chocolate, candy or junk food.\n\nClean, fresh water should be available at all times. Use an inverted bottle with a drinking tube that can be attached to the cage. Change the water daily. \n\nHamsters will stuff their face (literally) with food and then empty out whatever is in the pouch for some late-night snacking. When cleaning the cage, it’s not uncommon to find hidden stashes of food in the corners. \n\n\n\nSyrian hamsters are solitary animals and should live alone. If you choose to have more than one Syrian hamster, they must each have their own cage. No exceptions. Dwarf hamsters, however, are social animals that like to live in pairs. Make sure not to house male and female hamsters together, since rodents breed quickly and produce large litters. \n\nHamsters should be kept indoors in a solid bottom wire cage or a 10 gallon aquarium that has a wire mesh cover for ventilation.\n\nProvide different levels for your hamster to climb on and investigate. If you are using an aquarium, a simple homemade wooden platform with a ramp will do. \n\nMake sure the enclosure has a secure mesh top from which the hamster cannot escape but also provides adequate ventilation. Keep the cage away from direct sunlight, drafts, and other pets such as dogs and cats.\n\nThe inside of the enclosure should be lined with absorbent bedding. Bedding such as Carefresh (made from soft white cellulose fiber) or aspen shavings are appropriate choices. Avoid pine or cedar shavings – the fumes and oils from these woods are harmful to hamsters. Timothy hay can also be used. Remove soiled bedding, droppings, and stale food daily. Thoroughly clean the cage with warm, soapy water once a week.\n\nHamsters love exercise! Exercise wheels are a must, and cardboard tubes, PVC pipes, and plastic igloos provide them with opportunities to run, climb, hide, and tunnel. Hamsters need to chew to keep their teeth from overgrowing. An untreated, unpainted piece of hardwood, twig or even a hard plain dog biscuit is an appropriate chew toy. Avoid anything made of soft plastic. Your local pet supply store will also have chew toys made just for hamsters.\n\nHamsters like small enclosed spaces to sleep and hide such as a small box, igloo or flower pot.\n\nTo get your hamster used to being handled, start by hand feeding your hamster small treats. When they seem comfortable with taking treats, pick them up by scooping them into your hand. Once the hamster is successfully hand-tamed, you can start allowing them supervised romps outside of their cage for short periods of time. Make sure the exercise area has been checked for dangers and can be secured so they can’t escape. A hamster’s eyesight is not very good. Take extra care to make sure they don’t fall or hurt themselves when exercising outside of the cage.",
            "des-short": "hamsters are an iconic pet to have",
            "ref": "https://www.animalhumanesociety.org/adoption/hamster-care",
            "img-ref": "https://www.omlet.us/guide/hamsters/about_hamsters/anatomy",
            "img-name": "pet-shop-hamster.jpg",
            "url": "assets/images/pet-shop-animal-mammal/",
            "index": 0
        },
        {
            "name": "rat",
            "price": "376.05",
            "des": "Rats have only become pets in the past 100 years, but they are smart, friendly, and like to cuddle, making them great companions for families and kids. They are playful animals that desire human companionship. Caring for a pet rat is somewhat complicated; you'll need the right accessories, toys, and cage for your pet. Even though they are naturally short-lived pets, they can develop a variety of health issues. \n\nRats, unlike some other rodents, are smart and playful animals that crave human companionship. They're also (contrary to myth) very clean, and have almost no smell. They enjoy play and can even learn tricks. \n\n A large wire cage is best, especially one with horizontal bars that allow the rat to climb on the sides. A tall cage with ramps and platforms is ideal for providing room for multiple rats. At a minimum, a cage with 12 by 24 inches (2 square feet) of floor space is okay for two smaller rats as long as the cage is tall and you provide shelves and/or hammocks for extra living space. However, larger cages are always better. Large aquariums are insufficient as they do not provide good ventilation.\n\nAvoid cages with wire flooring; spending time on wire flooring has been linked to small cuts that can lead to bumblefoot in rats. If needed, you can modify wire balconies by covering them with a thin sheet of wood, melamine, or other easy-to-clean solid material (fixed to the cage with wire ties).\n\nIdeally, the cage should be placed in a relatively quiet place but still near the social activity in the home. Avoid direct sunlight or drafty zones. Rats are nocturnal so keep their space fairly quiet during the day. Limit access to the cage by other household pets; a rat will feel threatened by a hovering cat or dog. Placing the cage on a table or stand will help pet rats feel more secure.\n\nProvide some nesting material such as inkless paper, tissues, or paper towels, which the rats can use as bedding. Avoid the toxic cedar and pine wood shavings, but aspen or other hardwood shavings are fine. There are many good pet bedding and litter options available that are very absorbent, not dusty, and safe for small pets; consider using pelleted products (typically very absorbent) under a layer of softer loose bedding. Usually, rats will choose a designated bathroom area in one part of the cage. Scoop out heavily soiled litter daily, and add more litter when needed. Clean the whole cage and provide all new litter and bedding once a week.\n\nProvide your pet rat with a nest box. A cardboard box will need to be replaced often. Other possibilities include a flowerpot or jar turned on its side. Store-bought boxes are fine, but wooden ones can be hard to clean when they get urine-stained, and plastic boxes get chewed up fairly quickly. \n\n A water bottle with a sipper tube can be used for water. Make sure a supply of fresh clean water is always available. Heavy ceramic food dishes work best for rats as they are sturdy, won't tip over, and are easy to clean.\n\nPelleted or block type diets are available for rats and are formulated to be nutritionally complete. Choose a rat block that is low in fat and calories and has soy meal high on the ingredient list rather than corn. While rat blocks should comprise the basic diet, a variety of fresh foods can be used as a supplement to aid in keeping rats healthy and prevent boredom with the pelleted diet. Packaged loose mixes are also available, but rats tend to pick out their favorite bits from the mix and not eat a balanced diet; rotate all food options provided.\n\nTry feeding your pet rats small amounts of fruits and vegetables, whole grain pasta and bread, brown rice, yogurt, and occasionally low-fat cooked meat, mealworms, cheese, seeds, and nuts. In addition, treats such as dog biscuits can be given to your pet rat. It is important to keep rats on a high fiber and low-fat diet, so limit higher fat foods such as cheese, seeds, and nuts. Rats have a bit of a sweet tooth but resist the temptation to feed sugary foods or junk food, including chocolate. \n\n Rats can develop many of the same problems as cats, dogs, and even humans. Possible issues range from tumors to respiratory or digestive conditions to neurological problems. While it is physically possible to perform surgery on a rat, few owners are willing to pay for it, so disease prevention is the best option. If possible, identify an exotics veterinarian in your area (a vet with experience in treating unusual pets), and make an initial appointment to collect baseline health data. A check-up every six months is the best step toward preventing or managing disease.\n\nBumblefoot (ulcerative pododermatitis) is a painful condition in rats that causes ulcers on the bottoms of the animals' feet. It can be fatal if left untreated. This condition usually develops when a small wound on the foot becomes infected with Staphylococcus aureus or E. coli. \n\n Rats, like cats, come in a wide range of colors and color combinations including white with pink eyes (albino), cinnamon, blue-gray, and multi-colored. Except for the albinos, rats all have dark eyes. You can also choose a \"fancy\" rat; these are available only from breeders. Fancy varieties include the curly-haired Rex, the tailless and hairless rats, and the satin rat with its shiny coat. Dumbo rats have larger ears while bristle coat rats have stiff coats.\n\nIf you're not looking for a fancy rat, you can easily adopt babies from a rescue center, or purchase one (ideally, two) at a local pet shop. Look carefully at your prospective pets to be sure they are active and healthy with a clean, well-groomed coat of fur. Take the time to observe that any rat is eating and drinking properly. Finally, check to see that the other rats with which it is living are also healthy, active, and clean. \n\n Rats love to climb and will make good use of ladders, ropes, hammocks, tunnels, and platforms. Provide enrichment items like blocks of wood for chewing, cardboard tubes, and toys designed for ferrets or parrots. Look for rope and wood toys since most plastic toys can't stand up to the gnawing of a determined rat. Simple items like large cardboard mailing tubes, crumpled paper, paper bags, and cardboard boxes can also make wonderful homemade rat toys.\n\nRats are very intelligent and need to be challenged, so rotate the toys on a regular basis to avoid boredom. Some rats like to run on exercise wheels (and some will never try!), but the wire type commonly found in pet stores isn't very safe for rats who can get feet, toes, and tail caught; a solid surface wheel is preferable.\n\nThe play area outside the cage needs to be rat-proofed since rats will chew on just about anything they can get their teeth into. Most importantly, ensure that electrical wires are out of reach or encased in rigid plastic tubing. Ensure that your rat cannot access anything that is toxic, including poisonous plants. Rats also tend to scent mark as they roam, leaving little drops of urine. The odor is not offensive, but you may want to cover furniture with a throw while they are out of the cage. They will also scent mark on their owners, so be prepared! \n\n Rats have sharp toenails; trim them every one to two months. Nail trimming is not difficult, however, your rat will probably object and try to squirm away. Use a pair of human nail clippers to trim a little off the tip if needed. Avoid the pink portion (the quick) that may be visible inside the nail; this is where there are blood vessels and nerves.\n\nIf you do happen to nick the blood vessel, apply a little cornstarch to the nail tip to stop any bleeding. (You can also buy a product at the pet store called Kwik Stop that is used the same way.) At the same time that you check the nails, try to get a glimpse of the teeth to make sure they have not become overgrown. Provide lots of opportunities (with woodblocks and toys) for your rats to chew; this will keep their teeth short and healthy. \n",
            "des-short": "rats are unique pets with bad names, however they are very easy to care for and loving beginner animals",
            "ref": "https://www.thesprucepets.com/caring-for-pet-rats-1236746",
            "img-ref": "https://www.thehour.com/news/article/Police-Woman-19-buys-pet-rat-defying-her-14893889.php",
            "img-name": "pet-shop-rat.jpg",
            "url": "assets/images/pet-shop-animal-mammal/",
            "index": 1
        },
        {
            "name": "dog",
            "price": "436.99",
            "des": "The dachshund is a friendly, loving dog with a keen sense of smell, but he possesses a stubborn streak. Your doxie requires a slightly different approach to care than most dogs, mostly because of his elongated back. Grooming needs depend on his hair type. Caring for him requires the proper food and grooming, scheduled veterinary visits, moderate exercise, consistent training sessions and lots of hugs and kisses.\nStep 1\n\nKeep a step stool or ramp by the couch or the bed, and carry him if you have stairs. Even though he is capable of climbing up and down stairs, he can aggravate any possible disk problems with his spine. Avoid opportunities for your doxie to jump on items.\nStep 2\n\nFeed him a quality dog food to keep his weight under control. Quality foods have less, if no filler, and use specific meat as their first ingredient. The grains are easier to digest, as well. Limit the doggie treats and human food treats, as extra weight on his back can lead to herniated disks.\nStep 3\n\nBrush your doxie regularly to distribute the oils in his skin and avoid dryness. Short-haired doxies can be brushed once or twice a week with a soft-bristled brush. Wire-haired and long-haired doxies need brushing every day or every other day. Use a hard-bristle brush if you have a wire-haired pup and a slicker brush for your long-haired doxie. Combs work well on long-haired doxies to loosen any mats or tangles.\nStep 4\n\nBathe your doxie only when needed, as too many baths can dry out his skin. Lather with a mild shampoo, rinse thoroughly and avoid drafts. Towel-dry short-haired doxies and blow dry long-haired and wire-haired doxies.\nStep 5\n\nBrush your doxie's teeth with dog toothpaste, with either a finger brush or regular dog toothbrush. Brush either every day or as often as your vet advises. Begin slowly by brushing just a few teeth until he becomes used to the idea.\nStep 6\n\nWalk your doxie every day to control his weight. Teach your pup to heel. If he understands that he is to walk beside you, not in front of you, he is less likely to take the position of the alpha dog. Teach your pup to sit. As you hold a treat over his head, guide him into a sitting position and say, \"Sit.\" Praise him and give him the treat.",
            "des-short": "dog is man's best friend. Because there are so many breeds of dog, there is no single discription for them",
            "ref": "https://dogcare.dailypuppy.com/care-dachshund-dogs-1439.html",
            "img-ref": "https://petcentral.chewy.com/what-is-the-best-dog-food-for-small-dogs/",
            "img-name": "pet-shop-dog.jpg",
            "url": "assets/images/pet-shop-animal-mammal/",
            "index": 2
        },
        {
            "name": "cat",
            "price": "830.37",
            "des": "Have you recently added a feline friend to your family? Congratulations! We know you’ll be thrilled to have your new cat in your home. If you are considering adopting a cat, please visit your local shelter. We encourage you to browse our directory of adoptable cats in your area, or use our shelter finder to start your search.\n\nRead on for useful tips for new cat parents, and for those looking to brush up on their pet care skills.\n\nWe recommend purchasing high-quality, brand-name kitten or cat food. Your veterinarian will be able to assess your new cat or kitten and determine the best diet. Factors such as age, activity level and health make a difference in what and how much a cat should eat.\n\n    Cats require taurine, an essential amino acid, for heart and eye health. The food you choose should be balanced for the life stage of your cat or kitten. Properly balanced foods will contain taurine.\n    You will need to provide fresh, clean water at all times, and wash and refill your cat’s water bowls daily.\n    Treats should be no more than 5-10% of the diet.\n    Many people feed baby food to a cat or kitten who is refusing food or not feeling well  Please read labels carefully: If the baby food contains onion or garlic powder, your pet could be poisoned.\n    Take your pet to your veterinarian if signs of anorexia, diarrhea, vomiting or lethargy continue for more than two days.\n    Please visit our People Foods to Avoid Feeding Your Pets page for a list of off-limits items, as well as our Cat Nutrition Tips page for more information.\n\nMost cats stay relatively clean and rarely need a bath, but you should brush or comb your cat regularly. Frequent brushing helps keep your cat's coat clean, reduces the amount of shedding and cuts down on the incidence of hairballs. Please visit our Cat Grooming Tips page for more information.\n\nTo pick up your cat, place one hand behind the front legs and another under the hindquarters. Lift gently. Never pick up a cat by the scruff of the neck or by the front legs.\n\nYour pet should have her own clean, dry place in your home to sleep and rest. Line your cat's bed with a soft, warm blanket or towel. Be sure to wash the bedding often. Please keep your cat indoors. Outdoor cats do not live as long as indoor cats. Outdoor cats are at risk of trauma from cars, or from fights with other cats, raccoons and free-roaming dogs. Coyotes are known to eat cats. Outdoor cats are more likely to become infested with fleas or ticks, as well as contract infectious diseases.\n\nIf allowed outdoors, your cat must wear a safety collar and an ID tag. A safety collar with an elastic panel will allow your cat to break loose if the collar gets caught on something. And for both indoor and outdoor cats, an ID tag or an implanted microchip can help ensure that your cat is returned if he or she becomes lost.\n\nAll indoor cats need a litter box, which should be placed in a quiet, accessible location. In a multi-level home, one box per floor is recommended. Avoid moving the box unless absolutely necessary, but if you must do so, move the box just a few inches per day. Keep in mind that cats won't use a messy, smelly litter box, so scoop solid wastes out of the box at least once a day. Dump everything, wash with a mild detergent and refill at least once a week; you can do this less frequently if using clumping litter. Don't use ammonia, deodorants or scents, especially lemon, when cleaning the litter box. If your cat will not use a litterbox, please consult with your veterinarian. Sometimes refusal to use a litter box is based on a medical condition that required treatment. Please visit our Litter Box Problems page for more information.  \n\nCats need to scratch! When a cat scratches, the old outer nail sheath is pulled off and the sharp, smooth claws underneath are exposed. Cutting your cat’s nails every two to three weeks will keep them relatively blunt and less likely to harm the arms of both humans and furniture. Provide your cat with a sturdy scratching post, at least three feet high. The post should also be stable enough that it won't wobble during use, and should be covered with rough material such as sisal, burlap or tree bark. Many cats also like scratching pads.\n\nYour cat should see the veterinarian at least once a year for an examination and annual shots, and immediately if she is sick or injured.\n",
            "des-short": "cats are very self relient, make sure to give them a high protien diet",
            "ref": "https://www.aspca.org/pet-care/cat-care/general-cat-care",
            "img-ref": "https://www.thomaslabs.com/product/lysine-taurine/articles",
            "img-name": "pet-shop-cat.jpg",
            "url": "assets/images/pet-shop-animal-mammal/",
            "index": 3
        }
    ],
    "fish": [
        {
            "name": "neon tetra",
            "price": "234.27",
            "des": "The stunning Neon Tetra (Paracheirodon innesi) is a beautiful fish for any freshwater aquarium. This fish comes from parts of the world such as Africa, Central America, and South America. Some of these regions are already known for being of the same origins as other beautiful freshwater fish. Today, however, large numbers of tetras kept by aquarists are bred in captivity.\n\nThe neon tetra has a sleek body with the female usually having a more rounded belly than the male. These are not big fish by any means, and the average size of neon tetras is right around 1.5 inches. Although, some report them growing to be roughly 2.5 inches long.\n\nWhen you look at this fish, you will also notice its large bulging eyes. But still, it’s a dazzling fish.\n\nWhen it comes to the color of tetras, there seems to be a neverending number. They can be found in blue, red, silver, orange, black, white, yellow, and fluorescent colors. Not only do the colors of tetras vary, but so does their overall look.\n\nOne crazy thing about this fish is that they can actually turn off their bright hues when they feel threatened. This is a defense mechanism that allows them to hide. This same thing can be done when they are sick or sleeping.\n\nMy neon tetras have great temperaments, just like they all do. They are the furthest thing from aggressive. Tetras get along with all the fish in my tank and are very energetic fish. They like to swim in the middle of the tank with other tetras, but also like to have places to hide.\n\nYou’ll also notice that when it’s feeding time, and you drop a few fish flakes into the tank, these guys are always the first ones to show up.\n\nTetras are omnivores. This means they will eat both plants and animals. They do best when fed a variety of food such as fish flakes, brine shrimp, and freeze-dried blood worms. When these fish are younger, you can actually feed them a few times a day, but as they grow into maturity, feeding can be reduced to just one time a day. As a reminder, be careful with overfeeding your fish.\n\nThe size of a tank required to keep neon tetras always depends on what other aquatic life you plan on keeping. Usually, neon tetras do the best swimming together in schools of six to eight. With this in mind, it’s often recommended that they be placed in a tank that is at least 20 gallons or more. Again, you might want to reassess tank size if you plan on keeping other types of fish or aquatic life in your fish tank. For example, if you were to keep a school of tetras in a fish tank with a blue crayfish as well, you’d definitely want a bigger tank.\n\nTetras are great for community fish tanks. Because of their temperaments, they will get along with a vast number of different types of fish. However, it’s always best to do a little research before just placing neon tetras with any type of fish. There’s a huge and rather interesting selection of freshwater fish you can consider keeping in your aquarium.\n\nThe lifespans of neon tetras can vary based on care and the environment in which they live. Generally speaking, however, the neon tetra, when kept in captivity will live roughly five years. And, in the wild, it will live just around eight years. That’s quite a difference in lifespan from living in the two different environments.\n\nBreeding neon tetras is where it can get pretty tricky. Lots of things have to be done correctly in order for breeding to be a success.\n\nTo breed neon tetras, you will need a separate fish tank. The first thing you’ll want to do is to get the water conditions just right. The water should have a hardness of 1 to 2 dGH, and a pH of 5.0 to 6.0. It should also be kept between 72 to 75 degrees.\n\nIt’s suggested to use a sponge filter for filtration. Also, it’s a good idea to place live plants into the breeding tank.\n\nAlways remember to cover the tank because it’s common for spawning fish to jump. You’ll also need to cover the sides of the tank to reduce light.\n\nYou’ll want to feed the neon tetras that will mate live food before placing them into the breeding tank. It’s important that when you place the fish into the tank, there is no light.\n\nOn the next day, slowly introduce light into the tank. Do not do this too quickly. As this happens, the male and female will come together during spawning and the female will release over 100 eggs into the water. The eggs will often stick to plants in the tank. This is normal.\n\nIt’s important to remove both the male and female fish from the tank immediately after the eggs are laid. If not, the male and female will eat the eggs.\n\nAfter the male and female are removed from the tank, keep the eggs under very low light and allow 24 hours or so for hatching. After feeding off of their eggs for several days, the tiny neon tetras will be able to swim on their own. Once this happens, they will need to be fed tiny amounts of food that include rotifers, egg yolk, or store-bought fry food. After the first month, these new fish will develop their adult tetra colors.\n\nIt’s important to note, that of the hundred-plus eggs that are laid, the majority will not survive.\n\nIn this blog, we looked at a popular type of freshwater fish, the neon tetra, and the different types of tetras overall. This is a fish that is easy to care for, lives for about five years in captivity, and has a great temperament. Therefore it is a great fish for community tanks. These fish do best when swimming in small schools, and if you plan on keeping them in groups of six to eight, you will want at least a 20-gallon tank. If you decide you want to add even more fish to your fish tank, you should consider an even larger tank size. Neon tetras are omnivores and can and should be fed a wide variety of food including brine shrimp, freeze-dried blood worms, and fish flakes. Finally, we talked about breeding and how it can be tricky, but if done right, you can hatch quite a few neon tetras.",
            "des-short": "neon tetra are easy fish to take care of, great for beginners",
            "ref": "https://www.caringforyourcrayfishbuddies.com/neon-tetras/",
            "img-ref": "https://www.caringforyourcrayfishbuddies.com/neon-tetras/",
            "img-name": "pet-shop-neon-tetra.jpg",
            "url": "assets/images/pet-shop-animal-fish/",
            "index": 0
        },
        {
            "name": "guppy",
            "price": "660.73",
            "des": "Guppies go by many different names, including rainbow fish, millionfish, and their Latin title, Poecilia reticulata.\n\nApart from being one of the most widely distributed tropical fish, they’re also commonly kept in freshwater aquariums.\n\nYou’ll most frequently find guppies in South America, particularly in countries such as Brazil, Barbados, and Guyana.\n\nNowadays, guppies show up in pretty much every freshwater body within their reach. You can easily find them in streams situated near coastal fringes in mainland South America.\n\nMore recently, they’ve also been introduced to most other countries around the world in an attempt to control mosquito breeding.\n\nWhich is actually a pretty big deal:\n\nThe fish are known to feed on mosquito larvae and are expected to halt the spreading of malaria in countries affected by the disease. Big feat for a small fish!\n\nThough small in size, guppies can display wide ranges of colors and patterns, as well as fin and tail shapes.\n\nThis is largely because guppies have been chosen for breeding by hobbyists for decades, and in effect, they’ve managed to produce many different variations throughout the years–too many for any human to reel off.\n\nHere’s how it works:\n\nWhen breeders mix and match individual characteristics by initiating sexual reproduction, they can end up creating hundreds and hundreds of different breeds.\n\nThough guppy fish are sexually dimorphic (meaning that males and females express different characteristics) there are three main features that set individual breeds apart:\n\nGuppies can come in every color you could possibly imagine, from metallic blue to bright orange.\n\nYou can usually see these color variations on their upper and lower bodies; the head and upper body are typically lighter in color than the tail.\n\nThough gray is the most dominant color of guppy species, colors like gold, platinum, and even albino white are also fairly common.\n\nYou might think something as small and subtle as the shape of a tail fin wouldn’t differ much from guppy to guppy.\n\nBut you’d be wrong!\n\nSelective breeding has given rise to a pretty impressive variety of tail fin shapes across guppy species.\n\nThese include large fan tails, square flag tails, double sword tails, and many, many more variations (like seriously, a lot!).\n\nThough we’ve already discovered hundred of different species of guppy, it’s likely that tons more will come to exist in the future as hobbyists continue to breed individual fish together.",
            "des-short": "guppies are colorful fish, they are very delicate though because of massive inbreeding",
            "ref": "https://modestfish.com/guppy-care/",
            "img-ref": "https://www.newson6.com/story/5e6fc8ecf86011d4820c3a15/15-best-tropical-fish-for-beginners--14-is-the-number-1-selling-fish",
            "img-name": "pet-shop-guppy.jpg",
            "url": "assets/images/pet-shop-animal-fish/",
            "index": 1
        },
        {
            "name": "goldfish",
            "price": "514.92",
            "des": "Among the most common fish in the aquarium hobby, goldfish belong to the Family Cyprinidae and are native to Eastern Asia. They are not the same, but related to carp, and were first domesticated from food fish in China over 1,000 years ago. Goldfish can be distinguished from koi and common carp by the absence of barbels or “whiskers” in the corners of their mouth. Through selective breeding, many “fancy” goldfish strains sporting different body shapes, colors and fin types are available today. They include comets, shubunkins, fantails, orandas, ryukins, moors, telescope eyes, celestial eyes, bubble eyes, butterfly tails, pearlscales, wakins, lionheads, ranchus and many more. Orandas, lionheads and ranchus develop a crown of fatty tissue, called hood growth, over their heads that in mature fish may completely cover their eyes! Fancy goldfish can become stunningly beautiful and command high prices. All varieties of goldfish are the same species – Carrassius auratus. When properly cared for, goldfish can live over 20 years in captivity. \n\nGoldfish are ubiquitous in nature and can be found in rivers, streams, lakes, ponds, reservoirs and virtually every freshwater habitat on the planet from temperate to tropical environments. They have been introduced to many parts of the world to control mosquito populations.\n\nConsidered cold water fish, goldfish can also be kept in heated aquariums. The optimum temperature for fancy goldfish is 68° to 74° F, while comets and shubunkins should be kept between 60° and 70°F.  pH is not critical, but ideally should be between 7.0 and 8.4. Rapid changes in temperature or water chemistry can be harmful, if not fatal to goldfish. A tablespoon of aquarium or sea salt per 5 gallons can also be used to help keep goldfish in good health. Maintain good filtration and change 10% of the water weekly or 25% every 2 weeks using an Aqueon Aquarium Water Changer or Siphon Vacuum Gravel Cleaner. Don’t forget to treat tap water with Aqueon Water Conditioner before refilling your aquarium!\n\nGoldfish should never be kept in bowls, small aquariums or any unfiltered container! In addition to having relatively high oxygen demands, they grow to be quite large and generate a significant amount of waste, which can be harmful if allowed to accumulate. Common goldfish, comets and shubunkins make excellent outdoor pond fish and are known to survive relatively cold winters. Fancy goldfish, such as orandas, ryukins, moors and others, can also be kept in outdoor ponds, but are more vulnerable to predators and must be brought in during winter in harsh climates. In aquariums, adult common goldfish, comets and shubunkins should have at least 20 gallons of water per fish, while adult fancy goldfish should have at least 10 gallons per adult fish. The filter should be slightly over-sized to accommodate high waste production and additional aeration is recommended when goldfish are kept at warmer temperatures. Larger goldfish will eat many types of live plants, with the possible exception of Cryptocorynes, Java fern and Anubias, although they may uproot these, too. Avoid decorations with sharp edges and abrasive rocks such as lava and tufa, which may tear delicate fins as well as eye sacs on bubble eyes, celestial eyes, moors and telescopes. Goldfish like to forage in the substrate, so avoid jagged or crushed glass gravel.  Provide adequate water flow but avoid strong currents. \n\nGoldfish get along well with most peaceful, similarly sized fish. Fin nippers and boisterous fish should be avoided. If housed without a heater, they should be kept with other fish that are tolerant of cooler water temperatures. They are gregarious, meaning they like to hang around together. They are intelligent, have long memories and can become very tame. They can be taught to hand-feed and interact with their owners. They can also distinguish their owners from other humans. Goldfish of different sizes can be kept together, however, commons, comets and shubunkins may become too boisterous for smaller fancy goldfish as they grow and may need to be separated. Always consult an aquarium expert before adding any new fish to your aquarium. \n\nGoldfish are omnivores, feeding largely on crustaceans, insects and plant matter in the wild. A combination of Aqueon Goldfish Flakes, Goldfish Granules and Goldfish Color Granules will provide a high-quality diet. Frozen and live foods, including hornwort plant, can also be given as treats. Goldfish are naturally bottom feeders and may gulp air when feeding at the surface, causing them to lose equilibrium and float upside down. To avoid this, soak flake foods briefly before feeding and avoid the use of floating pellets. For best results, rotate your fishes’ food daily and feed only what they can consume in 2 to 3 minutes, once or twice a da\n\nGoldfish are egg scatterers and are known to spawn in home aquariums. They provide no parental care after the eggs are laid. Eggs are adhesive and can be seen clinging to plants and other decorations. To prevent eggs from being eaten by the adults or other fish in the aquarium, plants and other objects they are attached to can be moved to a separate aquarium where they will hatch in 48 to 72 hours.\n",
            "des-short": "gold fish should not be kept in bowls",
            "ref": "https://www.aqueon.com/information/care-sheets/goldfish",
            "img-ref": "https://www.tampabaypond.com/products/koi-gold-fish",
            "img-name": "pet-shop-goldfish.jpg",
            "url": "assets/images/pet-shop-animal-fish/",
            "index": 2
        }
    ],
    "bird-supplies": [
        {
            "name": "cuddle bone",
            "price": "400.89",
            "des": "\n    Cuttlebone is the internal shell of a cuttlefish which is extremely high in calcium and other healthy minerals. Ours is 100% natural and sun-dried, but it might have a few minor yellow spots and some peeling sides. It is very fragile and breaks easily, but any broken piece is edible and usable!\n    No Additives, Natural and Fresh: Derived from sun dried cuttlefish, helps keep finch and canary beaks conditioned and supply essential calcium and minerals. There will be a slight fish smell, not so strong.  Chicken smells like chicken, fish smells like fish\n    Great for all Birds: from canaries and finches to large parrots - Trimmed and ready to use - For African Greys: they can be fed broken chunks as they require more calcium than most any other parrot\n    Our Sun-Dried all natural Cuttlebone is packed inside a protective blister pack. You may notice some tips get broken due to shipping and handling, but animals will eat the large whole pieces as quickly as they will eat the broken pieces\n    Easy to Install on Cage: Equipped with holder to allow easy installation on cage - Includes 3 cuttlebones and each may vary between 5.5 and 6 inches in length\n\n\nfor African Greys and other larger parrots, simply break up the cuttlebone and add a few pieces to their daily food. For Mynah birds and Toucans, simply scrape the cuttlebone and allow the shavings to drop into their food. For all other small finch and small parrots, simply attach to cage bars. Make sure that the soft side of the cuttlebone is facing the bird.",
            "des-short": "good source of calcuim for your pet birds",
            "ref": "https://www.amazon.com/Birds-LOVE-Cuttlebone-Cockatiels-Parakeets/dp/B07VXYS8T5/ref=sr_1_3?dchild=1&keywords=bird+supplies&qid=1607205559&sr=8-3",
            "img-ref": "https://www.amazon.com/Birds-LOVE-Cuttlebone-Cockatiels-Parakeets/dp/B07VXYS8T5/ref=sr_1_3?dchild=1&keywords=bird+supplies&qid=1607205559&sr=8-3",
            "img-name": "pet-shop-supplies-bird-cuddle-bone.jpg",
            "url": "assets/images/bird-supplies/",
            "index": 0
        },
        {
            "name": "automatic feeder",
            "price": "475.60",
            "des": "It seems pricey at first glace, but considering the options it's a cheaper choice. My 13 year old cockatiel loves to throw his food around. So it was either buy this or invest in an expensive cage that has the food guards. A couple hundred dollars or $15, hmmm... It's well worth the price. Now I don't have to sweep under his cage constantly. My bird usually hates new things & won't go near them for weeks. So, I put food on the bottom of the feeder too (under the perch), grabed him and put him in the feeder after I installed it. He was about to climb out, but saw the food and gave it a taste. Now he hangs out in there all day long. I think he likes the view without the cage bars. In order to get it to fit I had to face the hooks sideways, put the hooks underneath the door bars, straighten the hooks again & hook it on the cage bars (so it hooks between door bars &onto the horizontal cage bags). Its hard to explain. I'll post a picture for you to see what I mean. ",
            "des-short": "a good way to feed your bird if you are forgetful",
            "ref": "https://www.amazon.com/Tidy-Seed-No-Mess-Feeder-Small/dp/B0037UKP9G/ref=sr_1_8?dchild=1&keywords=bird+supplies&qid=1607205813&sr=8-8",
            "img-ref": "https://www.amazon.com/Tidy-Seed-No-Mess-Feeder-Small/dp/B0037UKP9G/ref=sr_1_8?dchild=1&keywords=bird+supplies&qid=1607205813&sr=8-8",
            "img-name": "pet-shop-supplies-bird-feeder.jpg",
            "url": "assets/images/bird-supplies/",
            "index": 1
        },
        {
            "name": "jungle gym",
            "price": "700.55",
            "des": "\n    RELIEVES STRESS & BOREDOM: Our Bird Life Activity Centers provide for the perfect outlet for your pet’s curiosity, exercise, and socialization. They’ll love spending some time outside of the cage, playing with an assortment of toys and activities.\n    INCLUDED FEATURES: Our Large Activity Centers contain all of the following: 6-Step ladder, 100% Cotton Rope with Acrylic Toy, Cosmic-Links Climbing Toy, Play Swing, and Copper Bell.\n    MEASUREMENTS: Overall Size of Large: 10” (H) x 14” (W) 10” (D)\n    CHOOSE FROM SEVERAL SIZES: Our playpens come in various sizes: Small, Medium, Large, Extra-large. As their size increases, so does the included perches and ladders.\n    SHOP PENN-PLAX FOR ALL YOUR PET’S NEEDS: Penn-Plax is a manufacturer and distributor of top quality pet supplies, who specialize in creating excellent pet products for animals, both great and small.\n\nBird Life Presents the Large Bird Life Activity Center by Penn-Plax. This item provides for the perfect outlet for your pet’s curiosity, exercise, and socialization. They’ll love spending some time outside of the cage, playing with an assortment of toys and activities. Included Features: Our Large Activity Centers contain all of the following: 6-Step ladder, 100% Cotton Rope with Acrylic Toy, Cosmic-Links Climbing Toy, Play Swing, and Copper Bell. Measurements: Overall Size of Large: 10” (H) x 14” (W) 10” (D). Choose From Several Sizes: Our playpens come in various sizes: Small, Medium, Large, Extra-large. As their size increases, so does the included perches and ladders. Shop Penn-Plax For All Your Pet’s Needs: Penn-Plax is a manufacturer and distributor of top quality pet supplies, who specialize in creating excellent pet products for animals, both great and small. ",
            "des-short": "a fun way for your bird to exercise",
            "ref": "https://www.amazon.com/Pen-Plax-Bird-Activity-Center-Large/dp/B0002DJL50/ref=sxin_9?ascsubtag=amzn1.osa.f65607b7-c3b2-4991-8433-8763ce9445c5.ATVPDKIKX0DER.en_US&creativeASIN=B0002DJL50&cv_ct_cx=bird+supplies&cv_ct_id=amzn1.osa.f65607b7-c3b2-4991-8433-8763ce9445c5.ATVPDKIKX0DER.en_US&cv_ct_pg=search&cv_ct_we=asin&cv_ct_wn=osp-single-source-gl-ranking&dchild=1&keywords=bird+supplies&linkCode=oas&pd_rd_i=B0002DJL50&pd_rd_r=6ae87433-b3d1-4115-ac6b-2d28bd849de7&pd_rd_w=fdxwb&pd_rd_wg=4u1Xa&pf_rd_p=5ca5891e-f8d5-441d-985e-3d725696ef70&pf_rd_r=516D2FBCJ8719HEHX04W&qid=1607219069&sr=1-3-d9dc7690-f7e1-44eb-ad06-aebbef559a37&tag=5042nst800sr-20",
            "img-ref": "https://www.amazon.com/Pen-Plax-Bird-Activity-Center-Large/dp/B0002DJL50/ref=sxin_9?ascsubtag=amzn1.osa.f65607b7-c3b2-4991-8433-8763ce9445c5.ATVPDKIKX0DER.en_US&creativeASIN=B0002DJL50&cv_ct_cx=bird+supplies&cv_ct_id=amzn1.osa.f65607b7-c3b2-4991-8433-8763ce9445c5.ATVPDKIKX0DER.en_US&cv_ct_pg=search&cv_ct_we=asin&cv_ct_wn=osp-single-source-gl-ranking&dchild=1&keywords=bird+supplies&linkCode=oas&pd_rd_i=B0002DJL50&pd_rd_r=6ae87433-b3d1-4115-ac6b-2d28bd849de7&pd_rd_w=fdxwb&pd_rd_wg=4u1Xa&pf_rd_p=5ca5891e-f8d5-441d-985e-3d725696ef70&pf_rd_r=516D2FBCJ8719HEHX04W&qid=1607219069&sr=1-3-d9dc7690-f7e1-44eb-ad06-aebbef559a37&tag=5042nst800sr-20",
            "img-name": "pet-shop-supplies-bird-toy1.jpg",
            "url": "assets/images/bird-supplies/",
            "index": 2
        },
        {
            "name": "bowls",
            "price": "973.51",
            "des": "\n    🌸DURABLE MATERIAL - This bird bowls are made of durable stainless steel, rust resistant, crack resistance and dishwasher safe, which are long lasting.\n    🌸EASY TO INSTALL - It's convenient to install inside or outside the bird parrot cage to hold food or water and it's east to clean. A Great Bird dishes for bird cage accessories.\n    🌸SPLIT DESIGN - The parrot feeder consists of a bowl and a lifting ring, and the bowl can be easily removed from the stand. It is easy to clean and is very convenient to fill food or water.\n    🌸BIRD FEEDING DISH CUPS SIZE - 10 Ounce: 10x10x4.5 cm (3.9\"x3.9\"x1.8\"); The pet bowl comes with 2 parts, one is the brackets, the other part is the stainless steel bowl, which is easy to disassemble and clean.\n    🌸CONNECT WITH BIRD CAGE - The bird cups are fixed with the cages and can hanging in the cages, which can be used for hold food or water, prevents your bird from accidentally tipping food/water bowl.\n",
            "des-short": "use to feed and water your bird",
            "ref": "https://www.amazon.com/Feeding-Stainless-Parakeet-Cockatiels-Lovebird/dp/B0899V9C3H/ref=sr_1_44?dchild=1&keywords=bird+supplies&qid=1607219356&sr=8-44",
            "img-ref": "https://www.amazon.com/Feeding-Stainless-Parakeet-Cockatiels-Lovebird/dp/B0899V9C3H/ref=sr_1_44?dchild=1&keywords=bird+supplies&qid=1607219356&sr=8-44",
            "img-name": "pet-shop-supplies-bird-bowls.jpg",
            "url": "assets/images/bird-supplies/",
            "index": 3
        }
    ],
    "reptile-supplies": [
        {
            "name": "cave",
            "price": "179.17",
            "des": "\n    PERFECT FOR REPTILES, SMALL FISH, AND OTHER AQUATIC PETS: the Penn Plax Shale Cave Hide-Out is a great addition to any aquarium or terrarium. It’s perfect for territorial fish, small reptiles, newts, salamanders, crayfish, axolotls, snakes, and more!\n    Realistic rock formation: the beautiful hand painted details make this hideout a perfect natural-looking addition to your animal’s habitat - It will blend seamlessly with any environment, aquatic or dry.\n    BEST USED FOR CLIMBING AND HIDING SPOTS: no matter what animal you’ve got, they’ll love this Shale Cave…they’ll climb up, over, and around, and use it as a hiding space.\n    HELPS YOU MIMIC THE LOOK OF A NATURAL HABITAT: the Shale Cave is designed to mimic natural rocks found in desert environments. It’ll look great in an aquarium, terrarium, and any other kind of habitat that’s home to a small animal.\n    Shop Penn Plax for all your pet’s needs: Penn Plax has a wide variety of pet supplies available for purchase on Amazon. Shop for all your pet’s needs – for your reptiles, aquatic pets, birds, small animals, cats, dogs, amphibians, and more!\n\nPenn Plax and Reptology Life Science present the Shale Step Ledge and Cave Hide Out, perfect for all sorts of small animals. It measures 7” L x 9” W x 3. 5” H, and is perfect for snakes, reptiles, newts, salamanders, axolotls, crayfish or lobsters, territorial fish, geckos, and more! (We’ve got one in a 7 gallon tank in the office that the Zoidberg the blue lobster loves to hide in and climb around. She uses it for protection when she sheds by piling up gravel and rocks at all the entrances and exits. )The beautiful hand painted resin mimics the look of a rock formation found in natural habitats. The product is light-weight and easy to place in the wet or dry habitat of your choice. With its natural colors, it will blend seamlessly with any environment, aquatic or dry. Shop Penn Plax for all your Pet Supply needs! Penn Plax has a wide variety of Pet Supplies available for purchase, here on . Search for products for your underwater friends, as well as for your dogs, cats, small animals, reptiles, birds, and more! ",
            "des-short": "a good place for your reptile to hide",
            "ref": "https://www.amazon.com/Penn-Plax-Shale-Hide-Out-Medium-Aquarium/dp/B0018CJNEI/ref=sr_1_3?dchild=1&keywords=reptile+supplies&qid=1607219613&sr=8-3",
            "img-ref": "https://www.amazon.com/Penn-Plax-Shale-Hide-Out-Medium-Aquarium/dp/B0018CJNEI/ref=sr_1_3?dchild=1&keywords=reptile+supplies&qid=1607219613&sr=8-3",
            "img-name": "pet-shop-cave.jpg",
            "url": "assets/images/reptile-supplies/",
            "index": 0
        },
        {
            "name": "timer",
            "price": "254.67",
            "des": "\n    24/7 Digital Timer allows for daily programming with on/off outlets as well as constant power outlets\n    8 Total outlets - 4 daytime/nighttime alternating outlets and 4 constant power outlets\n    Easy-to-use digital programming and LCD display\n    Take complete control of habitat fixture on/off cycles with one power strip\n    Up to 1875 watts, 15 amps\n\nWith minute-by-minute accuracy, this Digital Power Center centralizes the control of lights, filters and heaters for a healthier reptile habitat. Simple fingertip controls make it easy to set a weekâ€™s on/off schedule to mimic a sun cycle for light and heat. Control four devices at one time, while allowing four others to run constantly. Digital design includes a large central LCD readout, plus internal controls with fewer mechanical components to break down. This ruggedly built, UL listed device comes with a 12-month manufacturerâ€™s warranty ",
            "des-short": "helps save energy while using equipment for reptiles",
            "ref": "https://www.amazon.com/Zilla-Reptile-Habitat-Lighting-Terrarium/dp/B0012GTRSW/ref=sr_1_5?dchild=1&keywords=reptile+supplies&qid=1607219834&sr=8-5",
            "img-ref": "https://www.amazon.com/Zilla-Reptile-Habitat-Lighting-Terrarium/dp/B0012GTRSW/ref=sr_1_5?dchild=1&keywords=reptile+supplies&qid=1607219834&sr=8-5",
            "img-name": "pet-shop-timer.jpg",
            "url": "assets/images/reptile-supplies/",
            "index": 1
        },
        {
            "name": "humidifier",
            "price": "809.91",
            "des": "\n    Adjustable Cool Fog Output: Our compact, ultrasonic, cool mist humidifying fogger is perfect for pets requiring a humid environment. With adjustable fog output control (up to 300 ml per hour), you can ensure that your pet is completely comfortable!\n    Perfect For Any Reptile / Amphibian / Herp: Perfect for a wide variety of reptiles and amphibians, whether it's your bearded dragon, gecko, snake (python, boa, etc.), turtle, tortoise, iguana, lizard, chameleon, water dragon, frog, toad or hermit crab\n    Large Tank With Dry-run Protection: Our tank holds up to 2 liters of water (2 times most competing humidifiers) and features a no-spill valve for easy filling. Dry-run protection shuts off the device when the tank is empty. Flexible adjustable hose ranges from 1.5 - 5 feet\n    Compatible With Virtually All Enclosures And Easy To Assemble: Easy assembly - comes with full set of instructions and tips. Compatible with a variety of enclosures, whether it's your vivarium, tank, cage, terrarium, vision cage, aquarium, reptarium, or plastic/PVC/glass cage. Best used along with a hygrotherm or timer to provide a rest period for the reptile humidifier. NOTE: Please use only distilled water\n    Best-in-class Warranty And Customer Service: We never leave a customer hanging - our humidifier is tested and trusted by tens of thousands of happy customers. Unlike other fly-by-night brands, every Evergreen Pet Supplies Reptile Fogger comes with a 6 month warranty. if you need anything, please message our team directly through Amazon. What's more, when used as directed, our reptile fogger offers a longer lifespan than the average of other comparable humidifiers (based on in-house testing)\n\nAdjustable Cool Fog Output\nOur compact, ultrasonic, cool mist humidifying fogger is perfect for pets requiring\na humid environment. With adjustable fog output control (up to 300 ml per hour),\nyou can ensure that your pet is completely comfortable!\n\nPerfect For Any Reptile / Amphibian / Herp\nPerfect for a wide variety of reptiles and amphibians, whether it's your bearded\ndragon, gecko, snake (python, boa, etc.), turtle, tortoise, iguana, lizard, chameleon,\nwater dragon, frog, toad or hermit crab.\n\nLarge Tank With Dry-run Protection\nOur tank holds up to 2 liters of water (2 times most competing humidifiers)\nand features a no-spill valve for easy filling. Dry-run protection shuts off the device\nwhen the tank is empty. Flexible adjustable hose ranges from 1.5 - 5 feet.\n\nCompatible With All Enclosures And Easy To Assemble\nEasy assembly - comes with full set of instructions and tips. Compatible with a variety\nof enclosures, whether it's your vivarium, tank, cage, terrarium, vision cage, aquarium,\nreptarium, or plastic/PVC/glass cage. Best used along with a hygrotherm or timer to provide\na rest period for the reptile humidifier. Note: Please use only distilled water.\n\nBest-in-class Warranty And Customer Service\nWe Never leave a customer hanging - our humidifier is tested and trusted by tens\nof thousands of happy customers. Unlike other fly-by-night brands, every Evergreen\nPet Supplies Reptile Fogger comes with a 6 month warranty. If you need anything,\nplease message our team directly through Amazon. What's more, when used as directed,\nour reptile fogger offers a longer lifespan than the average of other comparable humidifiers\n(based on in-house testing).",
            "des-short": "keeps the habitate the right humidity for your pet reptile",
            "ref": "https://www.amazon.com/Evergreen-Pet-Supplies-Reptile-Humidifier/dp/B01CO9582Y/ref=sr_1_7?dchild=1&keywords=reptile+supplies&qid=1607220052&sr=8-7",
            "img-ref": "https://www.amazon.com/Evergreen-Pet-Supplies-Reptile-Humidifier/dp/B01CO9582Y/ref=sr_1_7?dchild=1&keywords=reptile+supplies&qid=1607220052&sr=8-7",
            "img-name": "pet-shop-humidifier.jpg",
            "url": "assets/images/reptile-supplies/",
            "index": 2
        },
        {
            "name": "thermometer",
            "price": "942.98",
            "des": " Mini Digital Humidity Thermometer allows you to easily know the environment temperature and humidity around you\n2in1 meter with built-in probe; digital electronic thermometer and hygrometer for measuring temperature and humidity for indoor use\nFahrenheit (°F) display, this thermometer displays temperature in Fahrenheit\nTemperature measuring range: -58℉-158℉ ; Humidity measuring range: 10%-99%RH (Measures conditions every 10 seconds)\nTemperature measurement accuracy: ±2℉; Humidity measurement accuracy: ±5%RH \n",
            "des-short": "safety device to make sure your pet is in the right temperature",
            "ref": "https://www.amazon.com/TAIWEI-Electronic-Temperature-Thermometer-Hygrometer/dp/B07MCGDN5C/ref=sr_1_21?dchild=1&keywords=reptile+supplies&qid=1607220501&sr=8-21",
            "img-ref": "https://www.amazon.com/TAIWEI-Electronic-Temperature-Thermometer-Hygrometer/dp/B07MCGDN5C/ref=sr_1_21?dchild=1&keywords=reptile+supplies&qid=1607220501&sr=8-21",
            "img-name": "pet-shop-thermometer.jpg",
            "url": "assets/images/reptile-supplies/",
            "index": 3
        }
    ],
    "mammal-supplies": [
        {
            "name": "stick ball",
            "price": "117.54",
            "des": "\n\n    Willow branch ball small pet chew.\n    Wholesome and appealing playtime chew toy\n    Encourages healthy activity\n    Measures 4-inch width by 4-inch depth by 4-inch height\n    Pack of 3\n\n3153 Features: -Small pet toy. -Encourages healthy activity. -All natural and totally safe willow branch. -Harvested from renewable wood source. Small Animal Type: -Ferret/Rabbit/Hamster/Guinea Pig/Mouse/Rat/Chinchilla. Accessory Type: -Toys. Pet Category: -Small Animals. Color: -Browns. Generic Dimensions: -4\" H x 4\" W x 4\" D. Dimensions: Overall Height - Top to Bottom: -4 Inches. Overall Width - Side to Side: -4 Inches. Overall Depth - Front to Back: -4 Inches. Overall Product Weight: -0.1 Pounds. \n",
            "des-short": "a toy that will keep your small mammal's teeth healthy",
            "ref": "https://www.amazon.com/Willow-Branch-Ball-Small-Animals/dp/B0161NRED0/ref=sr_1_1?dchild=1&keywords=small+mammal+supplies&qid=1607220997&sr=8-1",
            "img-ref": "https://www.amazon.com/Willow-Branch-Ball-Small-Animals/dp/B0161NRED0/ref=sr_1_1?dchild=1&keywords=small+mammal+supplies&qid=1607220997&sr=8-1",
            "img-name": "pet-shop-stick-ball.jpg",
            "url": "assets/images/mammals-supplies/",
            "index": 0
        },
        {
            "name": "bedding",
            "price": "687.29",
            "des": "\n    Jumbo**- includes two 113L bags of Aspen bedding\n    Expands to 8 cu ft. Total\n    100% satisfaction guarantee\n    All natural, no additives. Good for the pet good for the planet\n\nThere are few names you can trust in the small animal world. SPS is one of the top. I purchased this product only looking to get a small amount of Aspen to test out in my 2ft by 6.5ft guinea pig cage. Not only did less then a quarter of the bag completely take care of the cage, but I was also able to add a layer to the buns litter boxes as well! Shiba is a known kicker and she didn't even try with this product. Sherlock enjoyed nibbling the pieces that fell on the floor and knowing it is straight from the tree and not full of some weird chemicals gives me peace of mind letting him. Even the hard to please Tribble, the unimpressed Voldemort and the mess-maker Nimbus approved of a nice layer of shavings over their pellet litter. Perhaps it is that wonderful natural smell Aspen has! (No icky pine or cedar smell here!) The pigs, Rot and Geist, were also thrilled with the quality, chewing away and popcorning more then I have ever seen these two shy boys popcorn! I will definitely continue to purchase this product in the future! Their glowing reviews is all I need! \n",
            "des-short": "use to keep you small mammal's cage clean",
            "ref": "https://www.amazon.com/Small-Pet-Select-Aspen-Bedding/dp/B07MR1B8SF/ref=sr_1_19_sspa?dchild=1&keywords=small%2Bmammal%2Bsupplies&qid=1607221126&sr=8-19-spons&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExRzlTS0RZN1EwVFJNJmVuY3J5cHRlZElkPUEwNzU5MDE5M09SN1hTREFWWk9SUyZlbmNyeXB0ZWRBZElkPUEwMzExODY3T0NFU1g3SlBaWkEzJndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ&th=1",
            "img-ref": "https://www.amazon.com/Small-Pet-Select-Aspen-Bedding/dp/B07MR1B8SF/ref=sr_1_19_sspa?dchild=1&keywords=small%2Bmammal%2Bsupplies&qid=1607221126&sr=8-19-spons&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExRzlTS0RZN1EwVFJNJmVuY3J5cHRlZElkPUEwNzU5MDE5M09SN1hTREFWWk9SUyZlbmNyeXB0ZWRBZElkPUEwMzExODY3T0NFU1g3SlBaWkEzJndpZGdldE5hbWU9c3BfbXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ&th=1",
            "img-name": "pet-shop-bedding.jpg",
            "url": "assets/images/mammals-supplies/",
            "index": 1
        },
        {
            "name": "brush",
            "price": "859.45",
            "des": "\n    ★ THE PERFECT BRUSH TO GET ALL NASTY MATS OUT OF YOUR PET’S FUR – Hertzko’s Slicker Brush gently removes Loose Hair, and eliminates Tangles, Knots, Dander and trapped Dirt. WORKS GREAT ON DOGS AND CATS WITH ALL SIZES AND HAIR TYPES!\n    ★ GET RID OF MATS WITHOUT HURTING HER - The bristles are FINE bent wires designed to penetrate DEEP into the coat and is really able to groom the undercoat well without scratching your pet's skin!\n    ★ EASY TO CLEAN – When you’re done brushing your pet, Simply click the button and the bristles retract back into the brush, Making is SUPER SIMPLE to remove all the hair from the brush, So it’s ready for the next time use.\n    ★ YOUR PET WILL NOT ONLY ‘LOOK’ GOOD BUT ‘FEEL' GREAT TOO! – Our brush Grooms and massages for a healthy coat, increasing blood circulation and leaves your pet’s coat soft and shiny. Your Pet will love being brushed !\n    ★ COMFORTABLE, STRONG, AND DURABLE- Our Slicker Brush is especially designed with a COMFORT-GRIP and ANTI-SLIP HANDLE, which prevents hand and wrist strain no matter how long you brush your pet !\n",
            "des-short": "helps reduce shed from your dog or cat",
            "ref": "https://www.amazon.com/Hertzko-Self-Cleaning-Slicker-Brush/dp/B00ZGPI3OY/ref=sr_1_6?dchild=1&keywords=dog+supplies&qid=1607221328&sr=8-6",
            "img-ref": "https://www.amazon.com/Hertzko-Self-Cleaning-Slicker-Brush/dp/B00ZGPI3OY/ref=sr_1_6?dchild=1&keywords=dog+supplies&qid=1607221328&sr=8-6",
            "img-name": "pet-shop-brush.jpg",
            "url": "assets/images/mammals-supplies/",
            "index": 2
        },
        {
            "name": "cat toys",
            "price": "091.27",
            "des": "\n    Great Value--2 Retractable Wands,4 Worms,5 Feathers and 1 Pack Cat Rainbow Wand (Provide endless of fun) Durable & Retractable Cat Wand.The wand is made of high carbon fiber which makes it more durable and more flexible.The Rod can extend to 3 periarticular for teasing\n    High Quality & Safe--All toys are made of environmentally and safe materials.This cat wand toy is made of high quality,safe,non-toxic,Eco-friendly material.The feather is from nature.\n    Healthy & Lively Cats--These cat toys can provide hours of exercise & self-amusement.With these toys, say goodbye to the boring time.It will help to increase their movement & keep fit healthy,release cat's extra energy to achieve weight loss, stabilize their nervous emotion.\n    Improve Relationship--With the wand feather toys,you can interactive with your kittens.Bring you and your cat a happy time.\n    Statement--According to customers' feedback,we have UPGRADED the wands(Since Oct.2019.),it's more strong and durable now.If there is any problems,We will arrange the return right away.\n",
            "des-short": "a good item to entertain your cat",
            "ref": "https://www.amazon.com/JJYPET-Kitten-Assortments-Crinkle-Balls/dp/B07G76ZM57/ref=sxin_9_pb?cv_ct_cx=cat+supplies&dchild=1&keywords=cat+supplies&pd_rd_i=B07G76ZM57&pd_rd_r=d55de82d-ab1e-4877-8be9-55eb4d5c8dae&pd_rd_w=2JgSM&pd_rd_wg=ZgC28&pf_rd_p=ffb450f7-bfad-4e7e-95e8-f2bd147e99a4&pf_rd_r=BXS8FY679NP2TS8NM8AT&qid=1607221494&sr=1-2-8065ff8c-2587-4a7f-b8da-1df8b2563c11",
            "img-ref": "https://www.amazon.com/JJYPET-Kitten-Assortments-Crinkle-Balls/dp/B07G76ZM57/ref=sxin_9_pb?cv_ct_cx=cat+supplies&dchild=1&keywords=cat+supplies&pd_rd_i=B07G76ZM57&pd_rd_r=d55de82d-ab1e-4877-8be9-55eb4d5c8dae&pd_rd_w=2JgSM&pd_rd_wg=ZgC28&pf_rd_p=ffb450f7-bfad-4e7e-95e8-f2bd147e99a4&pf_rd_r=BXS8FY679NP2TS8NM8AT&qid=1607221494&sr=1-2-8065ff8c-2587-4a7f-b8da-1df8b2563c11",
            "img-name": "pet-shop-cat-toy.jpg",
            "url": "assets/images/mammals-supplies/",
            "index": 3
        }
    ],
    "fish-supplies": [
        {
            "name": "siphon",
            "price": "444.86",
            "des": "\n    Hand Pump to Initiate the Siphon to Start Transferring Liquid from One Receptacle to Another\n    Discharge Hose Clip Included (2019 Updated) Simply Attach the Discharge Hose Clip to your container. Prevents hose from falling off container.\n    Two Types of Nozzles: Shorter Nozzle is for drainage & The Longer Nozzle is for cleaning fish leftover food, droppings and fine gravel / Takes the Waste out while Replacing the Water; Will not Hurt any Aquarium Life when in use\n    Patented Unique Pump Filter Allows dirt and Sand to be Discharged along with water\n",
            "des-short": "quickly removes water and waste from the fish tank",
            "ref": "https://www.amazon.com/TERA-PUMP-Genuine-Aquarium-Controller/dp/B011DDJW4M/ref=sxin_9?ascsubtag=amzn1.osa.8342faad-f356-4103-bb06-5fa019ea816a.ATVPDKIKX0DER.en_US&creativeASIN=B011DDJW4M&cv_ct_cx=fish+supplies&cv_ct_id=amzn1.osa.8342faad-f356-4103-bb06-5fa019ea816a.ATVPDKIKX0DER.en_US&cv_ct_pg=search&cv_ct_we=asin&cv_ct_wn=osp-single-source-gl-ranking&dchild=1&keywords=fish+supplies&linkCode=oas&pd_rd_i=B011DDJW4M&pd_rd_r=c4a223b7-afb0-43b8-8496-e2d10bbe5c6b&pd_rd_w=XjJFE&pd_rd_wg=bnsYm&pf_rd_p=5ca5891e-f8d5-441d-985e-3d725696ef70&pf_rd_r=593SEW9HDWW5G5656RGD&qid=1607221723&sr=1-2-d9dc7690-f7e1-44eb-ad06-aebbef559a37&tag=pawtracksdt-20",
            "img-ref": "https://www.amazon.com/TERA-PUMP-Genuine-Aquarium-Controller/dp/B011DDJW4M/ref=sxin_9?ascsubtag=amzn1.osa.8342faad-f356-4103-bb06-5fa019ea816a.ATVPDKIKX0DER.en_US&creativeASIN=B011DDJW4M&cv_ct_cx=fish+supplies&cv_ct_id=amzn1.osa.8342faad-f356-4103-bb06-5fa019ea816a.ATVPDKIKX0DER.en_US&cv_ct_pg=search&cv_ct_we=asin&cv_ct_wn=osp-single-source-gl-ranking&dchild=1&keywords=fish+supplies&linkCode=oas&pd_rd_i=B011DDJW4M&pd_rd_r=c4a223b7-afb0-43b8-8496-e2d10bbe5c6b&pd_rd_w=XjJFE&pd_rd_wg=bnsYm&pf_rd_p=5ca5891e-f8d5-441d-985e-3d725696ef70&pf_rd_r=593SEW9HDWW5G5656RGD&qid=1607221723&sr=1-2-d9dc7690-f7e1-44eb-ad06-aebbef559a37&tag=pawtracksdt-20",
            "img-name": "pet-shop-siphon.jpg",
            "url": "assets/images/fish-supplies/",
            "index": 0
        },
        {
            "name": "aquasafe",
            "price": "521.52",
            "des": "May be available at a lower price from other sellers, potentially without free Prime shipping.\n\n    age_range_description: all stages\n    Alkalinity and pH stabilizers prevent sudden, dramatic swings in pH that can be harmful to fish\nTetra EasyBalance Plus works to maintain healthy levels of essential aquarium water chemistry necessary to keep your fish happy and healthy. This easy-to-use formula regulates pH and alkalinity and reduces nitrates and phosphates. At the same time, Tetra EasyBalance Plus replenishes essential vitamins, minerals and electrolytes for maximum aquarium health. One teaspoon treats 5 gallons of aquarium water. Regular use of EasyBalance Plus reduces the need for water changes for up to 6 months.Use EasyBalance Plus weekly to maintain healthy aquarium conditions. Shake well before using. The top of the supplied screw cap can be used for measuring. Fill to inner ring line (5 mL or 1 teaspoon) to treat 5 gallons or use the full cap (10 mL) for 10 gallons. This product should not be used in aquariums with low oxygen conditions; proper aeration using an airstone is recommended. A properly maintained aquarium contains the correct stocking level of fish, aeration, proper filtration and regular testing.Since 1951, Tetra has developed the world’s most comprehensive body of fish food knowledge, and fishkeeping enthusiasts have looked to the brand for products and solutions that add ease and beauty to their home. Whether you're an experienced hobbyist or just starting out, Tetra has everything you need–-from a large variety of quality fish food and innovative equipment to test kits and decor. \n",
            "des-short": "makes the aquarium a safe home to live in",
            "ref": "https://www.amazon.com/Tetra-EasyBalance-Water-Conditioner-16-9-Ounce/dp/B0002DI2BE/ref=sr_1_6?dchild=1&keywords=fish+supplies&qid=1607222129&sr=8-6",
            "img-ref": "https://www.amazon.com/Tetra-EasyBalance-Water-Conditioner-16-9-Ounce/dp/B0002DI2BE/ref=sr_1_6?dchild=1&keywords=fish+supplies&qid=1607222129&sr=8-6",
            "img-name": "pet-shop-aquasafe.jpg",
            "url": "assets/images/fish-supplies/",
            "index": 1
        },
        {
            "name": "air pump",
            "price": "000.82",
            "des": "\n    POWERFUL: Tetra Whisper Air Pump provides dependable airflow to your aquarium.\n    QUIET: Patented dome shape, suspended motor and sound-dampening chambers for quiet operation.\n    AVAILABLE SIZES: Select the proper size for your tank – 10, 20 and 40-gallon pumps have single air outlets, 60 and 100-gallon pumps feature dual outlets.\n    NON-UL LISTED: Reliable performance at an economical cost.\n\nFor 50 years, fishkeeping enthusiasts have looked to the Tetra name for products and solutions that add ease and beauty to their home. Whether you're an experienced hobbyist or just starting out, Tetra has everything you need–-from a large variety of quality fish food and innovative equipment to test kits and decor. The Tetra Whisper Air Pump provides powerful, dependable air flow. This air pump is for up to 40 gallon aquariums. The Whisper Air Pump provides a reliable service at an economical cost. Efficient and easy to use, the Whisper Air Pump can handle the aeration needs of aquariums. Properly pumping your aquarium water keeps your tank functioning and creates a beautiful environment for your fish. Create a clean and clear environment that can be the focal point of any room. Be sure to get the proper size so it is not restricted and does not get too noisy. \n",
            "des-short": "keeps the water in the aquarium oxygenated",
            "ref": "https://www.amazon.com/Tetra-Whisper-Easy-Aquariums-Non-UL/dp/B0009YF4FI/ref=sr_1_12?dchild=1&keywords=fish+supplies&qid=1607222331&sr=8-12",
            "img-ref": "https://www.amazon.com/Tetra-Whisper-Easy-Aquariums-Non-UL/dp/B0009YF4FI/ref=sr_1_12?dchild=1&keywords=fish+supplies&qid=1607222331&sr=8-12",
            "img-name": "pet-shop-air-pump.jpg",
            "url": "assets/images/fish-supplies/",
            "index": 2
        },
        {
            "name": "decorations",
            "price": "115.34",
            "des": "\n    Ceramic base is more stable, plastic plant odorless, rust-free, does not affect the water quality in the tank.\n    There are 11 different styles, different colors of plants, the height is about 12 to 16 cm.\n    Easy to clean - The smooth surface is also very easy to wipe and keep clean. Please wash it before using!\n    With the water swaying, the simulation plants create a true underwater world for the fish.\n    100% Money Back Guarantee – in order to give you a better customer experience we promises a full refund to any dissatisfied customers.\n\nThis seller is very good. There was an issue with my purchase. He reached out quickly, took care of it and went beyond what He needed to. He obviously cares about his customers. A new set is on its way to me. I will purchase from this seller again. The leaves of the plants are pretty. They vary in size so are suitable for foreground, middle tank placement. I recommend. \n",
            "des-short": "make your fish tank look nice",
            "ref": "https://www.amazon.com/CousDUoBe-Artificial-Decorations%EF%BC%8CUsed-Simulation-Hydroponic/dp/B07CJ3GBSK/ref=sr_1_17?dchild=1&keywords=fish%2Bsupplies&qid=1607222518&sr=8-17&th=1",
            "img-ref": "https://www.amazon.com/CousDUoBe-Artificial-Decorations%EF%BC%8CUsed-Simulation-Hydroponic/dp/B07CJ3GBSK/ref=sr_1_17?dchild=1&keywords=fish%2Bsupplies&qid=1607222518&sr=8-17&th=1",
            "img-name": "pet-shop-decor.jpg",
            "url": "assets/images/fish-supplies/",
            "index": 3
        }
    ]
}